{
    "FirstSectionContent":[
        {
            "_id": 1,
            "title": "O que é?",
            "content": " Segundo a wikipidia a expressão acessibilidade Web refere-se a prática inclusiva de fazer websites que possam ser utilizados por todas as pessoas que tenham deficiência ou não. Quando os sites são corretamente concebidos, desenvolvidos e editados, todos os usuários podem ter igual acesso à informação e funcionalidade.\n \n A Acessibilidade consiste na facilidade de acesso e de uso de ambientes, produtos e serviços por qualquer pessoa e em diferentes contextos.",
            "image": "",
            "alt": "",
            "reference": ""
        },
        {
            "_id": 2,
            "title": "Qual a importância?",
            "content": "Quando uma página não está acessível, ela está fechando as portas para milhões de pessoas, não pensar em acessibilidade pode ser sinônimo de deixar dinheiro em cima da mesa, a acessibilidade também pode melhorar o rankeamento da sua página no Google, uma vez que o algoritmo do buscador reconhece essas práticas e o enxerga com maior relevância.\n \n Desde 2016 a Lei Brasileira de inclusão (LBI) exige que todos os sites, públicos e privados, estejam acessíveis. Infelizmente apenas 1% deles seguem essa regra no Brasil, ter um site acessível não é só cumprir a lei, é ter um diferencial competitivo.",
            "image": "",
            "alt": "",
            "reference": ""
        }
    ],
    "SecondSectionContent":[
        {
            "_id": 3,
            "title": "Não dependa de cores",
            "content": "Não use apenas cores para significado e informações aos nossos usuários. Como por exemplo verde para correto e vermelho para errado, cores devem ser complementares e  4,5% da população podem contar com elas.",
            "image": "https://miro.medium.com/max/1269/1*3zZomw8ROlQNk2QheEybaw.gif",
            "alt": "Desenho do rosto de uma mulher com expressoes que alternam entre alegria e tristeza de acordo com o grafico de cores",
            "reference": "https://medium.com/@oieduardorabelo/10-diretrizes-para-melhorar-sua-acessibilidade-na-web-6e35844f9859",
            "fonte":"Fonte:  Eduardo Rabelo - Diretrizes para melhorar sua Acessibilidade na web"
        },
        {
            "_id": 4,
            "title": "Use o atributo Alt na tag <img>",
            "content": "Se uma imagem é decorativa ou não é necessária para entender o conteúdo da página, você pode usar o simples alt.\n \n A função de uma imagem é tão importante quanto o seu significado: se o seu logotipo criar um link para à página inicial do seu site, o texto alternativo deverá ser algo como “Página inicial” ao invés de “Logotipo”.",
            "image": "https://miro.medium.com/max/1215/1*XPVDPXgLa1LxlITCV5zdSA.gif",
            "alt": " Um cavalo saindo de dentro de uma imagem da internet informando ao usuário com deficiencia visual que ele é um cavalo comendo cereal",
            "reference": "https://medium.com/@oieduardorabelo/10-diretrizes-para-melhorar-sua-acessibilidade-na-web-6e35844f9859",
            "fonte":"Fonte:  Eduardo Rabelo - Diretrizes para melhorar sua Acessibilidade na web"
        },
        {
            "_id": 5,
            "title": "Foco é essencial",
            "content": "É importante garantir que nossos sites sejam navegáveis pelo teclado. Muitos usuários confiam em um teclado quando navegam na web. Entre eles estão pessoas com deficiências motoras, pessoas cegas e pessoas que não têm mãos ou não podem usar um mouse ou track pad por qualquer motivo.\n \n Navegar em um site via teclado significa pular de um elemento focalizável para outro na ordem do DOM. Isso geralmente é realizado usando a Tabtecla ou Shift + Tabna direção inversa. Elementos focáveis são, entre outros , links, botões e elementos de formulário . Eles podem ser selecionados com a Entertecla e, às vezes, com Spacebar. Por serem focáveis e selecionáveis de diferentes maneiras, eles vêm com funcionalidades padrão muito úteis. Portanto, faz sentido usar elementos semânticos corretos e escrever HTML em uma ordem lógica.\n \n Elementos como <p>, <h2>ou <div>não podem ser focados por padrão. Geralmente, usamos tags como essas para criar componentes personalizados com JavaScript, o que pode ser problemático para os usuários de teclado.",
            "image": "https://miro.medium.com/max/2160/1*CSkLBSd5e9x3-n4kikV9ZA.gif",
            "alt": "Homem deficiente visual feliz, navegando pelo teclado do computador enquanto ao redor aparecem imagens do que ele esta acessando",
            "reference": "https://medium.com/@matuzo/writing-javascript-with-accessibility-in-mind-a1f6a5f467b9#7a0c",
            "fonte":"Fonte:  Matuzo - Writing javascript whith acessibility in mind"
        },
        
        {
            "_id": 6,
            "title": "Semântica, use as tags apropriadas.",
            "content": "Quando você escolhe conscientemente uma tag <h1> em um <p> ou um <span>,você está deliberadamente alterando o significado de um elemento, fornecendo hierarquia e criando uma estrutura em árvore das informações da sua página.\n Os leitores de tela estão atentos a isso. De fato, a semântica é uma de suas armas mais úteis.\n \nTenha em mente que, com grande poder, há uma grande responsabilidade, portanto, certifique-se de usar a tag semântica adequada para cada elemento.\n \nA ideia é que o leitor “diga” para o usuário o que é cada parte e tag do nosso site, assim, um site cheio de div ficará difícil de ser utilizado, pois o leitor não irá entender e nosso usuário será prejudicado, por isso deve-se usar as tags <header>,<main>,<article>, <footer>,<nav>,<aside> e etc, conforme sua  necessidade.\n \n - Um HTML semântico melhora a qualidade de SEO do site (posicionamento no rank de pesquisa da Google)/.\n \n - Leitores de tela saberão e conseguirão ler nosso site para usuários com deficiência/.\n \n -Torna a manutenção e entendimento do código mais fácil./",
            "image": "https://miro.medium.com/max/1215/1*kOznuvaFWevV7OjAa5f5dg.gif",
            "alt": "homem montando um torre de legos",
            "reference": "https://medium.com/@oieduardorabelo/10-diretrizes-para-melhorar-sua-acessibilidade-na-web-6e35844f9859",
            "fonte":"Fonte:  Eduardo Abelo - Diretrizes para melhorar sua Acessibilidade na web"
        },
        {
            "_id": 7,
            "title": "Botões e aria-label",
            "content": "O atributo aria-label é usado para definir um string na tag do elemento atual. Use nos casos que a tag do texto não seja visível na tela.\n No exemplo abaixo, um botão é denominado para olhar como um botão típico “Fechar” , com um X no meio. Uma vez que não há nada que indique que a finalidade do botão é para fechar a janela, o atributo aria-label é utilizado para fornecer o rótulo para quaisquer tecnologias assistiva. \n \n <button aria-label=“Fechar”  onclick=“myDialog.close()”>X</button>",
            "image": "https://imageshack.com/i/poH7ILN9p",
            "alt": "Botao em circulo com um X no meio",
            "reference": "https://developer.mozilla.org/pt-BR/docs/Web/Accessibility/ARIA/ARIA_Techniques/Using_the_aria-label_attribute",
            "fonte":"Fonte: MDN - Acessibility Aria Label"
        },
        {
            "_id": 8,
            "title": "Use Labels",
            "content": "A tag label funciona como uma espécie de indicador de caminho a seguir. Ela diz ao browser/agente de usuário/leitor de tela: “Hey, você está vendo aquele campo ali? Aquele de nome 'firstname'? Bem, aquele campo é meu, e, por favor não não faça confusão com ele nem comigo”. Ou, em código XHTML seria assim:\n \n<label for='firstname'>First Name</label><br />\n <input type='text' name='firstname' id='firstname' size='20'/>\n \n A tag <label> pode ser usada para todos os elementos de formulário, exceto para os elementos buttons (seu funcionamento independe de links externos).",
            "image": "https://miro.medium.com/max/1440/1*w8M7ANAO2sB8UJr8m1lCuA.gif",
            "alt": "Pessoa idosa que retira o placeholder Firstname e coloca em cima como uma label",
            "reference": "https://maujor.com/tutorial/acformint.html",
            "fonte":"Fonte: Maujor - Construindo Formularios acessíveis HTML/XHTML Acessíveis"
        },
        {
            "_id": 9,
            "title": "Adicione legendas a seus vídeos",
            "content": "No YouTube, por exemplo. Depois de enviar um vídeo para a plataforma, você pode habilitar legendas. Elas são geradas automaticamente e podem ser imprecisas em algumas circunstâncias, dependendo do idioma, do ruído de fundo ou do sotaque do interlocutor.\n \n No entanto, elas são muito fáceis de implementar e podem funcionar bem na maioria dos vídeos em inglês. O HTML5 inclui a tag <track>, que você pode usar para anexar facilmente quantos arquivos de legendas e subtítulos desejar, usando o formato WebVTT.",
            "image": "https://imageshack.com/i/pmb93Wb5p",
            "alt": "icone de closed-caption",
            "reference": "https://medium.com/@oieduardorabelo/10-diretrizes-para-melhorar-sua-acessibilidade-na-web-6e35844f9859",
            "fonte":"Fonte:  Eduardo Rabelo - Diretrizes para melhorar sua Acessibilidade na web"
        },
       
        {
            "_id": 10,
            "title": "Torne elementos não focalizáveis ​​focáveis",
            "content": "É possível tornar os elementos não focalizáveis, adicionando o tabindexatributo com um valor inteiro . Se o valor estiver definido como 0o elemento, ele se tornará focalizável e alcançável através do teclado.\n Se o valor for um número negativo, o elemento também poderá ser focalizado (por exemplo, com JavaScript), mas não acessível pelo teclado. Você também pode usar um valor maior que 0, mas isso altera a ordem natural das guias e é considerado um antipadrão.\n \n<h2 tabindex =“0”> Um cabeçalho focável </h2>",
            "image": "https://miro.medium.com/max/1136/1*-5gYiq83__A9gVoFbtz34A.gif",
            "alt": "ícone de um alvo com uma flecha co centro",
            "reference": "https://medium.com/@matuzo/writing-javascript-with-accessibility-in-mind-a1f6a5f467b9#7a0c",
            "fonte":"Fonte:  Matuzo - Writing javascript whith acessibility in mind"
        }
    ],
    "ThirdSectionContent":[
        {
            "_id": 11,
            "title": "Tradutor de sites Hand Talk",
            "content": "O tradutor de sites da Hand Talk é um plugin que deixa todo o conteúdo do site acessível em Libras, permitindo que o público surdo –  que a tem como primeira língua – navegue com autonomia. A instalação é rápida e simples: basta inserir o código no seu site que em questão de minutos o Hugo, intérprete virtual da Hand Talk, está pronto para realizar as traduções.",
            "image": "https://i.pinimg.com/originals/c3/09/6c/c3096cd1a4d63a70d96f3eb33403c517.png",
            "alt": "boneco virtual do Hugo fazendo o gesto em libras de I Love You ",
            "reference": "http://blog.handtalk.me/acessibilidade-na-web/",
            "fonte":"HandTalk"
        },
        {
            "_id": 12,
            "title": "a-blinX",
            "content": "O a-blinX capta o piscar dos olhos para ampliar as possibilidades de interação das pessoas com deficiências motoras severas.",
            "image": "https://tix.life/wp-content/uploads/2018/05/a-blinX-oculos-1024x683.jpg",
            "alt": "Foto do a-blinx",
            "reference": "https://tix.life/",
            "fonte":"tix.life"
        },
        {
            "_id": 13,
            "title": "Simplix",
            "content": "Criado em parceria com profissionais da educação especial e reabilitação, o Simplix permite criar facilmente atividades psicomotoras para finalidades pedagógicas ou terapêuticas.\n Em poucos minutos, é possível montar pranchas audiovisuais acessíveis por meio do Teclado TiX, de forma a trabalhar com alunos e pacientes com deficiência intelectual, déficit de atenção, dificuldades na fala, dentre muitos outros acometimentos.",
            "image": "https://tix.life/wp-content/uploads/2018/06/Simplix-TiX-com-M%C3%A1scara.jpg",
            "alt": "foto do Simplix",
            "reference": "https://tix.life/",
            "fonte":"tix.life"
        },
        {
            "_id": 14,
            "title": "Tix",
            "content": "Isoladamente, o TiX é um recurso inovador, que dá autonomia para pessoas com qualquer limitação motora controlarem qualquer computador. Porém, oferecer todas as funções de teclado e mouse com acessibilidade total é só um detalhe. Com apenas onze teclas sensíveis ao toque, que podem ser acionadas até mesmo pelo piscar dos olhos, o TiX vai muito além. Em conjunto com o software Simplix e seus acessórios, o TiX compõe uma incrível plataforma de inclusão escolar e reabilitação, capaz de desenvolver o motor e o cognitivo de alunos e pacientes com deficiências físicas e intelectuais.",
            "image": "https://tix.life/wp-content/uploads/2018/04/IMG_3465b-SEM-FUNDO-960x583.jpg",
            "alt": "Foto do teclado Tix",
            "reference": "https://tix.life/categoria_aplicacoes/tix/",
            "fonte":"Tix.life"
        }

    ],
   "FourthSectionContent":[
        {
            "_id": 15,
            "title": "ChromeVox ",
            "content": "Disponível para usuários de Mac e Windows, essa extensão do Chrome é um leitor de tela que você pode usar para testar seu website.",
            "image": "",
            "alt": "",
            "reference": "http://www.chromevox.com/",
            "fonte":"ChromeVox"
        },
        {
            "_id": 16,
            "title": "Filtro de cores",
            "content": "Teste seu site para diferentes tipos de daltonismo com essa ferramenta on-line.",
            "image": "",
            "alt": "",
            "reference": "https://www.toptal.com/designers/colorfilter",
            "fonte":"toptal.com"
        },
        {
            "_id": 17,
            "title": "W3C Validator",
            "content": "Esta ferramenta oficial do W3C permite que você saiba se a sua marcação HTML segue as regras de acessibilidade da web!",
            "image": "",
            "alt": "",
            "reference": "http://validator.w3.org/",
            "fonte":"validator.w3"
        },
        {
            "_id": 18,
            "title": "Plataforma de Conformidade A11Y",
            "content": "O Bureau de Acessibilidade à Internet (BOIA) oferece um relatório detalhado, com uma visão geral de como seu site se sai ao ser testado em relação aos pontos de verificação das WCAG A/AA.",
            "image": "",
            "alt": "",
            "reference": "https://www.boia.org/w3c-tools-services-a11y",
            "fonte":"boia.org"
        },
        {
            "_id": 19,
            "title": "WAVE",
            "content": "Uma ferramenta de avaliação de acessibilidade da web feita pelo WebAIM.",
            "image": "",
            "alt": "",
            "reference": "http://wave.webaim.org/",
            "fonte":"webaim"
        },
        {
            "_id": 20,
            "title": "Extensão ou aplicação para testes de acessibilidade",
            "content": "Extensão para Chrome e Microsoft Edge Insider para executar testes de acessibilidade em páginas da web e aplicativos da web.Teste seu aplicativo do Windows com experiências confiáveis ​​do Windows, como o Inspecione e o Color Contrast Analyzer, em uma única ferramenta.",
            "image": "",
            "alt": "",
            "reference": "https://accessibilityinsights.io/",
            "fonte":"accessibilityinsights"
        }

    ]
}